# Global dependencies, install with:
# brew bundle --verbose --global

# Base tools
brew 'dust'
brew 'rename'
# brew 'tofrodos'
brew 'tree'
brew 'watch'
brew 'zoxide'

# Base dev tools
# brew 'git'
brew 'jq'
brew 'the_silver_searcher'
brew 'yq'

# Build deps
brew 'autoconf'
brew 'automake'
brew 'coreutils'
brew 'libyaml'
brew 'openssl'
brew 'readline'
brew 'wxwidgets'

# Other dev tools
# cask 'chromedriver'
# brew 'exercism'
brew 'asdf'
brew 'gh'
# brew 'miller'
# cask 'sequel-pro'
cask 'postico'
# brew 'uv'

## Heroku
# tap 'heroku/brew'
# brew 'heroku'

# Performance tools
# brew 'jmeter'
# brew 'siege'

# Current projects

tap 'hashicorp/tap'
tap 'shimmur/tap'

# cask 'anypointstudio'
# brew 'protobuf'
brew 'shimmur/tap/qctl'
# cask 'tableplus'
# cask 'temurin'

## VPN
cask 'openvpn-connect'

## Hashicorp Vault, for prod secrets
brew 'hashicorp/tap/vault'

## Concourse CI
cask 'fly'

## Container runtimes
brew 'colima'
brew 'docker'
brew 'docker-buildx'
brew 'docker-compose'
brew 'kubernetes-cli'
cask 'freelens'

# Other tools
# brew 'ffmpeg', args: ['with-fontconfig', 'without-qtkit', 'without-xvid']
# brew 'imagemagick', args: ['with-fontconfig']
# brew 'ssh-copy-id'
# brew 'unrar'
# brew 'vbindiff'
# brew 'wget'
# brew 'youtube-dl'

# Apps
# cask '1password6'
# cask 'alarm-clock'
cask 'cursor'
# cask 'dash'
cask 'dropbox'
# cask 'firefox'
cask 'google-chrome'
cask 'insomnia'
# cask 'imagealpha'
# cask 'imageoptim'
# cask 'openemu'
# cask 'p4merge'
# cask 'rdm' # Redis Desktop Manager
cask 'rectangle'
# cask 'skype'
cask 'slack'
# cask 'spotify'
# cask 'sublime-text'
# cask 'techstoreclub-simple-comic'
# cask 'vlc'
# cask 'xld'
# cask 'zoom'

brew 'mas'

# mas '1Password', id: 443987910
# mas 'Amphetamine', id: 937984704
# mas 'CloudApp', id: 417602904
# mas 'Dash', id: 449589707
mas 'Double Shot', id: 1076145960
# mas 'HeliumLift', id: 1018899653
# mas 'Keynote', id: 409183694
# mas 'Monosnap', id: 540348655
# mas 'Shush', id: 496437906
# mas 'Slack', id: 803453959
# mas 'Telegram', id: 747648890
# mas 'The Unarchiver', id: 425424353
# mas 'Tweetbot', id: 557168941
# mas 'Twitter', id: 333903271
# mas 'Wunderlist', id: 410628904
