tap 'homebrew/bundle'
tap 'homebrew/core'
tap 'homebrew/services'

# Base tools
brew 'autojump'
brew 'bash'
brew 'bash-completion'
brew 'rename'
brew 'tofrodos'
brew 'tree'
brew 'watch'

# Base dev tools
brew 'git'
brew 'the_silver_searcher'

# Build tools
brew 'autoconf'
brew 'automake'
# brew 'coreutils'
# brew 'libyaml'
# brew 'openssl'
# brew 'readline'
brew 'wxmac'

# Other dev tools
brew 'chromedriver'
brew 'exercism'
brew 'jq'
brew 'heroku', args: ['ignore-dependencies'] # use asdf's Node instead

# Performance tools
brew 'jmeter'
brew 'siege'

# Current projects
cask 'java'
cask 'screenhero'
cask 'sequel-pro'
cask 'vagrant'
cask 'virtualbox'

brew 'cmake'
brew 'elasticsearch@2.4'
brew 'imagemagick@6', args: ['with-fontconfig']
brew 'mysql'
brew 'postgresql'
brew 'redis'
brew 'yarn', args: ['without-node']

# Other tools
# brew 'ffmpeg', args: ['with-fontconfig', 'without-lame', 'without-qtkit', 'without-xvid']
# brew 'imagemagick', args: ['with-fontconfig']
# brew 'ssh-copy-id'
# brew 'unrar'
# brew 'vbindiff'
# brew 'wget'
# brew 'youtube-dl'

# Apps
tap 'caskroom/cask'
# cask 'alarm-clock'
cask 'caffeine'
# cask 'dash'
cask 'dropbox'
cask 'firefox'
# cask 'franz'
# cask 'gog-downloader'
cask 'google-chrome'
cask 'insomnia'
cask 'imagealpha'
cask 'imageoptim'
# TODO 'iScrobbler' http://www.last.fm/group/iScrobbler / https://github.com/cgravolet/scroblr
# cask 'iterm2'
# cask 'jdownloader'
# cask 'licecap'
# cask 'openemu'
cask 'p4merge'
cask 'postico'
# cask 'rdm' # Redis Desktop Manager
# cask 'recordit'
# cask 'screenhero'
cask 'skype'
cask 'spotify'
# cask 'steam'
cask 'sublime-text'
# cask 'techstoreclub-simple-comic'
# cask 'transmission'
cask 'vlc'
# cask 'xld'

brew 'mas'
mas '1Password', id: 443987910
# mas 'CloudApp', id: 417602904
# mas 'Dash', id: 449589707
mas 'HeliumLift', id: 1018899653
mas 'Keynote', id: 409183694
mas 'Monosnap', id: 540348655
mas 'Slack', id: 803453959
mas 'The Unarchiver', id: 425424353
mas 'Tweetbot', id: 557168941
mas 'Wunderlist', id: 410628904
